app/controllers/flights_controller.rb

SELECT "flights".* FROM "flights"
---
    def index
        render json: Flight.all

SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
---
    def show
        @flight =  Flight.find params[:id]